Tekla Open API Reference for Tekla Structures 2025
LibraryProfileItem.Select Method (String)
 Selects the profile item in the profile database using the given name.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Select(
	string profileName
)
Public Function Select (
	profileName As String
) As Boolean
Parameters
profileName
Type: System.String
The name of the profile to select.
Return Value
Type: Boolean
True on success.
See Also
Reference
LibraryProfileItem Class
Select Overload
Tekla.Structures.Catalogs Namespace